simulation/openfoam/case_S/0/vorticity
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      vorticity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<vector> 
7132
(
(0 -1.73472e-15 0)
(0 -1.73472e-15 0)
(0 -0 0)
(0 -1.73472e-15 0)
(0 -1.73472e-15 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0 -1.73472e-15 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 1.73472e-15 0)
(0 -1.73472e-15 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
40
(
(0 -1.73472e-15 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -0 0)
(0 -1.73472e-15 0)
(0 -0 0)
(0 -0 0)
...
)
;
    }
    top
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    back
    {
        type            symmetryPlane;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<vector> 
192
(
(0 -0.0118655 301.727)
(0 -12.6313 -209.541)
(0 0.0514572 -179.992)
(0 0.0514572 179.992)
(0 -0.0514572 179.992)
(0 0.0514572 179.992)
(0 -0.0514572 179.992)
(0 -12.6313 209.541)
...
)
;
    }
}


// ************************************************************************* //
