simulation/openfoam/case_S/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       14638;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       14678;
    }
    top
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          160;
        startFace       14718;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          160;
        startFace       14878;
    }
    front
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          6600;
        startFace       15038;
    }
    back
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          6600;
        startFace       21638;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          192;
        startFace       28238;
    }
)

// ************************************************************************* //
