simulation/openfoam/case_S/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


convertToMeters 1;

vertices
(
    (-0.5 -0.5 -0.05)
    (7.5 -0.5 -0.05)
    (7.5 0.5 -0.05)
    (-0.5 0.5 -0.05)
    (-0.5 -0.5 0.05)
    (7.5 -0.5 0.05)
    (7.5 0.5 0.05)
    (-0.5 0.5 0.05)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (160 40 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }
    front
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
