simulation/openfoam/case_S/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     pimpleFoam;

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         20.0;

deltaT          0.01;

writeControl    timeStep;
writeInterval   20;

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;
maxCo           0.5;
maxDeltaT       0.01;

functions
{
    vorticity
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
}
