simulation/openfoam/case_S/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


numberOfSubdomains 4;
method scotch;

simpleCoeffs
{
    n (2 2 1);
    delta 0.001;
}

hierarchicalCoeffs
{
    n (2 2 1);
    delta 0.001;
    order xyz;
}

distributed no;
roots ();
